## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:36" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:36" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 36 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "6b37f8b0bc9fdf8b1860a5ea667850b5-5" -> "33197d2b5c1fd56ba250eb5e465a0c4b"
        id                     = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip"
        tags                   = {}
      ~ version_id             = "iKCOyfAOSOIg24cJW.ZNMfBDT3GnjfXX" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "609a397e9343c863307b70227cbb2c9a-6" -> "a353743c6db71a81967ec6cbdfe9b209"
        id                     = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip"
        tags                   = {}
      ~ version_id             = ".eN38kYZ83bGBbHaJ.pJhuKB9ABmJeYa" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "436ed85b7094766b29823e89f8b881ed-6" -> "0615f8b46e5bb166eace878a4b050ccb"
      ~ id                     = "graphql.9d7eed5e0daf13beb5c9b4716cacf80c.zip" -> (known after apply)
      ~ key                    = "graphql.9d7eed5e0daf13beb5c9b4716cacf80c.zip" -> "graphql.0615f8b46e5bb166eace878a4b050ccb.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "9d7eed5e0daf13beb5c9b4716cacf80c" -> "0615f8b46e5bb166eace878a4b050ccb"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "z189jn6_aGSVQBYW.7duzGhbg_rOvdcN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "99722992859fe45aacec0f371fc4fcd8" -> "0a1b65b0ab03b30f96d554718b7f0977"
        id                     = "dist/200.html"
      ~ source_hash            = "99722992859fe45aacec0f371fc4fcd8" -> "0a1b65b0ab03b30f96d554718b7f0977"
        tags                   = {}
      ~ version_id             = "TbmVDkI66HipUC7uZsK_b9RUBAt29xUI" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "63a9183cf0a3b98922a669efc19d09b7" -> "3b0fa3c8bd1e13279d45291c6d805bdc"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "63a9183cf0a3b98922a669efc19d09b7" -> "3b0fa3c8bd1e13279d45291c6d805bdc"
        tags                   = {}
      ~ version_id             = "kt.m_rbuFuiQbIPEftnXs.67A1Uy.Be9" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d1c5a3a24074ea5cb7ef5d12b16be141" -> "0866f3f7bb8c24652d319c0cda36de9f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "d1c5a3a24074ea5cb7ef5d12b16be141" -> "0866f3f7bb8c24652d319c0cda36de9f"
        tags                   = {}
      ~ version_id             = "k4P4k12CnBIz89JYD6EWnb586qpo1kL0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "99722992859fe45aacec0f371fc4fcd8" -> "0a1b65b0ab03b30f96d554718b7f0977"
        id                     = "dist/index.html"
      ~ source_hash            = "99722992859fe45aacec0f371fc4fcd8" -> "0a1b65b0ab03b30f96d554718b7f0977"
        tags                   = {}
      ~ version_id             = "rnzUDUKaF.bC8vs0Z4mumk07xkhf0_IP" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/517.cd3f67a4.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "4cd0cba353f48a7dbe6ad7490da7bc7a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/517.cd3f67a4.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/517.cd3f67a4.chunk.js"
+       source_hash            = "4cd0cba353f48a7dbe6ad7490da7bc7a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/517.cd3f67a4.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "38c1a507777ed8891149a972164d7a80"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/517.cd3f67a4.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/517.cd3f67a4.chunk.js.LICENSE.txt"
+       source_hash            = "38c1a507777ed8891149a972164d7a80"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.497ab58d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1a28f14e6c214a3f4bedf79c313197e3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.497ab58d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.497ab58d.chunk.js"
+       source_hash            = "1a28f14e6c214a3f4bedf79c313197e3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.497ab58d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "55d3003fc652eef3fccd962d62d4f328"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.497ab58d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.497ab58d.chunk.js.LICENSE.txt"
+       source_hash            = "55d3003fc652eef3fccd962d62d4f328"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.fbaaf820.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.fbaaf820.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "84030d4286604cc8ac79fc81bfb10085" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js" -> null
-       source_hash            = "84030d4286604cc8ac79fc81bfb10085" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "dNyobZNAvp6WoBRwzJDlfEvrYWqHicoJ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.fbaaf820.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.fbaaf820.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "55d3003fc652eef3fccd962d62d4f328" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.fbaaf820.chunk.js.LICENSE.txt" -> null
-       source_hash            = "55d3003fc652eef3fccd962d62d4f328" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "yK2OYrwIR.FL5PN5na7NxqIvWfKGDFHR" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.141ec034.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "c0e70b0c850bb33d1fa90fac69bbd5b3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js"
+       source_hash            = "c0e70b0c850bb33d1fa90fac69bbd5b3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "4e11d0eec7753fcebe4544ba4612e69d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt"
+       source_hash            = "4e11d0eec7753fcebe4544ba4612e69d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.7663501d.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.7663501d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1f75e27d78015e06ed74c86a1e441676" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js" -> null
-       source_hash            = "1f75e27d78015e06ed74c86a1e441676" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "zCldD41WkXVA8JF4yLENAgol4TcWTVIF" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "330ee0ebe4f567a6b50a756956869310" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "330ee0ebe4f567a6b50a756956869310" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9i378tFi.2F3tchxUM_bEjtPT84THVAY" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.2d788207.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "4e8a7c41a91fcc059642be678d5418df"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js"
+       source_hash            = "4e8a7c41a91fcc059642be678d5418df"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "16eb506bb04b8649c6a08c630eab671b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt"
+       source_hash            = "16eb506bb04b8649c6a08c630eab671b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "32aa396eb2a809c72e86036c7754bb7e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js" -> null
-       source_hash            = "32aa396eb2a809c72e86036c7754bb7e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "XbLnJa1riYEAV91COnLpZ370lKviopfr" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "2dbbc8114432eec3779954ec28b87eb4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "2dbbc8114432eec3779954ec28b87eb4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "4sBQNOowLtqWJJ3IgFT4SaqUeIywkVVM" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.3ff31ad8.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6e12896acbe49a77c2814aca9a19d514"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.3ff31ad8.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.3ff31ad8.js"
+       source_hash            = "6e12896acbe49a77c2814aca9a19d514"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.3ff31ad8.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1b85afb29451caa76c58431be24fd636"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.3ff31ad8.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.3ff31ad8.js.LICENSE.txt"
+       source_hash            = "1b85afb29451caa76c58431be24fd636"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c80a9f73.js"] will be destroyed
  # (because key ["static/js/app.c80a9f73.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5295c04856d3bc7af92ef8da147b5991" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c80a9f73.js" -> null
-       key                    = "dist/static/js/app.c80a9f73.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c80a9f73.js" -> null
-       source_hash            = "5295c04856d3bc7af92ef8da147b5991" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "4U5_aR0vF0FoEy.niW6fF1SAM6KxK4by" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c80a9f73.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.c80a9f73.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "1b85afb29451caa76c58431be24fd636" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c80a9f73.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.c80a9f73.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c80a9f73.js.LICENSE.txt" -> null
-       source_hash            = "1b85afb29451caa76c58431be24fd636" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "HLS8x3KN2gdXwp81DkjDBK2XICBji9oY" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.927b6670.js"] will be destroyed
  # (because key ["static/js/runtime-app.927b6670.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b92fb8114d0cb00cf7da50451bcf071f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.927b6670.js" -> null
-       key                    = "dist/static/js/runtime-app.927b6670.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.927b6670.js" -> null
-       source_hash            = "b92fb8114d0cb00cf7da50451bcf071f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "KInimXoPpDkiC_GPWLe79Njx7o6hvE50" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.a870ee50.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f31e3ad3001d9699d5be982613f75a7f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.a870ee50.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.a870ee50.js"
+       source_hash            = "f31e3ad3001d9699d5be982613f75a7f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:5/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
              ~ "DD_TAGS"                      = "git.commit.sha:4aa88b50d45fb76a2e3d97293e1b5d05539828e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:564f7235c9cac6645d915f4dae77760efda0b843,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:5/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
              ~ "DD_TAGS"                      = "git.commit.sha:4aa88b50d45fb76a2e3d97293e1b5d05539828e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:564f7235c9cac6645d915f4dae77760efda0b843,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-01-12T17:39:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:52" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:52/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.9d7eed5e0daf13beb5c9b4716cacf80c.zip" -> "graphql.0615f8b46e5bb166eace878a4b050ccb.zip"
        tags                           = {}
      ~ version                        = "52" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
              ~ "DD_TAGS"                            = "git.commit.sha:4aa88b50d45fb76a2e3d97293e1b5d05539828e1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:564f7235c9cac6645d915f4dae77760efda0b843,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "4aa88b50d45fb76a2e3d97293e1b5d05539828e1" -> "564f7235c9cac6645d915f4dae77760efda0b843"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "52" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 16 to add, 10 to change, 14 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7547928128)*